import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

import 'RoomItem.dart';



class RoomDetails extends StatefulWidget {
  static const routeName = '/roomdetail';

  const RoomDetails({Key? key}) : super(key: key);

  @override
  _RoomDetailsState createState() => _RoomDetailsState();
}

class _RoomDetailsState extends State<RoomDetails> {
  @override
  Widget build(BuildContext context) {
    final args = ModalRoute.of(context)!.settings.arguments as RoomItem;

    return Scaffold(
      appBar: AppBar(
        title: Text(
          (args.name),
          style: GoogleFonts.prompt(fontSize: 24.0),
        ),
      ),
      body: Container(
        decoration: BoxDecoration(
          image: DecorationImage(
            image: AssetImage("assets/images/boat.jpg"),
            fit: BoxFit.cover,
          ),
        ),
        child: Column(
          mainAxisAlignment: MainAxisAlignment.start,
          crossAxisAlignment: CrossAxisAlignment.stretch,
          children: [
            /*Image.asset(
              'assets/images/${args.image}',
            ),*/
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Card(
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Center(
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Text(
                          ('ชื่อห้องพัก: ' + args.name),
                          style: GoogleFonts.prompt(fontSize: 18.0),
                        ),
                        if (args.id == 1)
                          Text(
                            '-พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน 500 บาท/ ท่าน \n'
                            '(ไม่ได้บริการเตียงเสริม)\n'
                            '-วันธรรมดา 1,800 บาท/คืน\n-สุดสัปดาห์ 2,200 บาท/คืน\n-วันหยุดยาว 2,600 บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 2)
                          Text(
                            'พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน 500 บาท/ท่าน (ไม่ได้บริการเตียงเสริม)\n'
                            'วันธรรมดา\n'
                            '-Villa View (ชั้น1) 1,600 บาท/คืน\n'
                            '-Sea View (ชั้น2), 1,800 บาท/คืน\n'
                            'สุดสัปดาห์\n'
                            '-Villa View (ชั้น1) 2,000 บาท/คืน\n'
                            '-Sea View (ชั้น2) 2,500 บาท/คืน\n'
                            'วันหยุดยาว\n'
                            'Villa View (ชั้น1) 2,500 บาท\n'
                            'Sea View (ชั้น2) 3,000 บาท/คืน'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 3)
                          Text(
                            '- พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน 500 บาท/ท่าน\n'
                            '(ไม่ได้บริการเตียงเสริม)\n'
                            '- วันธรรมดา 1,900 บาท/คืน\n-สุดสัปดาห์ 2,500 บาท/คืน\n-วันหยุดยาว 3,000บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 4)
                          Text(
                            '- พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน 500 บาท/ท่าน \n'
                            '(ไม่ได้บริการเตียงเสริม)\n'
                            '- วันธรรมดา 2,900 บาท/คืน\n-สุดสัปดาห์ 3,500 บาท/คืน\n-วันหยุดยาว4,000บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 5)
                          Text(
                            '-พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน500 บาท/ ท่าน\n'
                            '(เสริมที่ Day Bed 2 จุดในห้องพัก)\n'
                            '-วันธรรมดา 3,200 บาท/คืน\n-สุดสัปดาห์ 3,800 บาท/คืน\n-วันหยุดยาว 4,500 บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 6)
                          Text(
                            '-พักได้ 2 ท่าน เสริมผู้เข้าพักได้สูงสุด 1 ท่าน 500บาท/ท่าน\n'
                            '(ไม่ได้บริการเตียงเสริม)\n'
                            '-วันธรรมดา 3,500 บาท/คืน\n-สุดสัปดาห์ 4,200 บาท/คืน\n-วันหยุดยาว 4,900 บาท/คืน'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 7)
                          Text(
                            '- พักได้ 10 ท่าน เสริมผู้เข้าพักได้สูงสุด 2 ท่าน 500 บาท/ท่าน\n'
                            '(มีบริการฟูกนอนเสริม)\n'
                            '- วันธรรมดา 10,000 บาท/คืน\n-สุดสัปดาห์ 12,000 บาท/คืน\n-วันหยุดยาว14,000บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                        if (args.id == 8)
                          Text(
                            'พักได้ 16 ท่าน สามารถเสริมผู้เข้าพักได้สูงสุด 2 ท่าน 500/ท่าน\n'
                            '(มีบริการฟูกนอนเสริม)\n'
                            'วันธรรมดา 16,000 บาท/คืน\n-สุดสัปดาห์ 18,000 บาท/คืน\n-วันหยุดยาว 20,000 บาท/คืน\n'
                            '-พร้อมอาหารเช้าเเบบ american breakfast บริเวณล็อบบี้ของทางรีสอร์ท\n'
                            '-บริการรถรับ-ส่ง ท่าเรือหน้าบ้าน , ฟรีเตาปิ้งย่าง(เเบบส่วนรวม)\n'
                            '-WI-FI ภายในห้องพัก'
                            '-เตียง 6 ฟุต, โทรทัศน์ , ตู้เย็น, กาต้มน้ำร้อน, ไดร์เป่าผม \n'
                            '-เครื่องปรับอากาศ, เครื่องทำน้ำอุ่น',
                          ),
                      ],
                    ),
                  ),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
